# 1 Сформировать список из N членов последовательности. Для N = 5: 1, -3, 9, -27, 81 и т.д.
# 2 Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1. 
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
# 3 ользователь задаёт две строки. Определить количество вхождений одной строки в другой.
# 4 Подсчитать сумму цифр в вещественном числе.
# 5 Написать программу получающую набор произведений чисел от 1 до N. Пример: пусть N = 4, 
# тогда [ 1, 2, 6, 24 ]